# вивести числа від 1 до 15 в десятковому, шістнадцятковому, вісімковому і двійковому представленні:
width = 5
for num in range(12):
    print('{:^10} {:^10} {:^10}'.format(num, num**2, num**3))

# вивести квадрати та куби чисел до 12 у вигляді таблиці, відцентрувавши значення у стовпцях по 10 символів шириною:
for i in range(16):
    s = "int: {0:d};  hex: {0:#x};  oct: {0:#o};  bin: {0:#b}".format(i)
    print(s)

# Міні-мова форматування рядків складається з таких модифікаторів, як:
# ім'я поля — необов'язковий елемент, можемо вказати, яку саме змінну сюди підставити за її ім'ям:
s = "{name} {last_name}".format(last_name="Dilan", name="Bob")
print(s)   # Bob Dilan

# Специфікація – набагато складніший модифікатор. З її допомогою можна:
# змінювати розрядність представлення цілих чисел (десяткові, вісімкові, шістнадцяткові та ін.);
print('dec: {:d} hex: {:x} bin: {:b}'.format(15, 15, 15))  # dec: 15 hex: f bin: 1111

# змінювати точність представлення дробових чисел (округлювати до вказаної кількості знаків);
print('pi: {:0.3}'.format(3.1415))  # pi: 3.14

# як відображати знак чисел:
print('"{}" "{:+}" "{:-}" "{: }"'.format(1, 2, -3, 4))  # "1" "+2" "-3" " 4"

# як вирівняти положення елементу і чим (якими символами) доповнити;
print("|{:<10}|{:*^10}|{:>10}|".format('left', 'center', 'right'))  # |left      |**center**|     right|